Revit 2027 API
MacroManager Properties
The MacroManager type exposes the following members.
Properties
Name | Description
Count |  The count.
Folder |  The modules folder.
IsEnabled |  Indicates if macros stored in this MacroManager are enabled.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace